Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
    // 加入新的 WiFi
    if (wifi_count < MAX_WIFI_COUNT)
    {
        strncpy(wifi_list[wifi_count].ssid, ssid, 31);
        wifi_list[wifi_count].ssid[31] = '\0';
        wifi_list[wifi_count].rssi = rssi;
        wifi_count++;
    }
}

// 顯示 WiFi 列表
void Display_WiFi_List(void)
{
    if (wifi_count == 0)
    {
        #if DEBUG_MODE
            uint8_t msg[] = "No WiFi found\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif
        return;
    }

    #if DEBUG_MODE
        char msg[128];
        int len = snprintf(msg, sizeof(msg), "\r\n=== WiFi Scan (%d networks) ===\r\n", wifi_count);
        HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);

        for (int i = 0; i < wifi_count; i++)
        {
            len = snprintf(msg, sizeof(msg), "%d. %s: %d dBm\r\n",
                          i+1, wifi_list[i].ssid, wifi_list[i].rssi);
            HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
        }

        uint8_t end[] = "============================\r\n\r\n";
        HAL_UART_Transmit(&huart2, end, sizeof(end)-1, 100);
    #endif
}

// 處理 WiFi 數據
void Process_WiFi_Data(void)
{
    // 將緩衝區轉為字串
    WFBuffer[wf_idx] = '\0';

    // 解析每一行
    char* line_start = (char*)WFBuffer;
    char* line_end;

    while ((line_end = strchr(line_start, '\n')) != NULL)
    {
        *line_end = '\0'; // 結束當前行

        // 檢查是否為 CWLAP 回應
        if (strstr(line_start, "+CWLAP:") != NULL)
        {
            #if DEBUG_MODE
                char msg[128];
                int len = snprintf(msg, sizeof(msg), "WiFi: %s\r\n", line_start);
                HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
            #endif

            Parse_WiFi_Line(line_start);
        }
        else if (strstr(line_start, "OK") != NULL)
        {
            // 掃描完成，顯示結果
            Display_WiFi_List();

            // 清空列表準備下次掃描
            wifi_count = 0;
            memset(wifi_list, 0, sizeof(wifi_list));
        }

        line_start = line_end + 1;
    }

    wf_idx = 0;
    memset(WFBuffer, 0, WIFI_BUF_SIZE);
}

void epd_ticket_handler(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time,
						char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
{   //0 16 32 48 64 80 96 112 128 144 160 176 192 208 224 240 256 272 288 304
	//0 8 16 32 40 48 56 64 72 80 88 96 104 112 120 128 136 144 152 160
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Clear(&hepd, ColorWhite);

	if (strcmp(train_type, "THSR") == 0)  SSD1680_Text(&hepd, 64, 0, "THSR", &cp866_8x16);
	else if (strcmp(train_type, "TRA") == 0)  SSD1680_Text(&hepd, 64, 0, "TRA ", &cp866_8x16);

	if (date != NULL)  SSD1680_Text(&hepd, 0, 16, date, &cp866_8x16);
	if (train_kind != NULL && strcmp(train_type, "TRA") == 0)  SSD1680_Text(&hepd, 88, 16, train_kind, &cp866_8x16);
	if (train_kind != NULL && (strcmp(train_type, "THSR") == 0)) SSD1680_Text(&hepd, 88, 16, train_kind, &cp866_8x8);
	if (train_num != NULL && (strcmp(train_type, "THSR") == 0))
	{
		if (train_num[0] == '0')  SSD1680_Text(&hepd, 88, 24, train_num + 1, &cp866_8x8);
		else  SSD1680_Text(&hepd, 88, 24, train_num, &cp866_8x8);
	}

	SSD1680_Text(&hepd, 88, 40, "Depart", &cp866_8x14);
	char convert_dept_time[6] = {0};
	convert_dept_time[0] = dept_time[0];
	convert_dept_time[1] = dept_time[1];
	convert_dept_time[2] = ':';
	convert_dept_time[3] = dept_time[2];
	convert_dept_time[4] = dept_time[3];
	convert_dept_time[5] = '\0';
	SSD1680_Text(&hepd, 88, 56, convert_dept_time, &cp866_8x16);
	SSD1680_Text(&hepd, 8, 40, sta_code_decoder(dept_sta), &cp866_8x16);

	SSD1680_Text(&hepd, 88, 72, "Car", &cp866_8x16);
	if (car[0] == '0') SSD1680_Text(&hepd, 128, 72, car + 1, &cp866_8x16);
	else SSD1680_Text(&hepd, 128, 72, car, &cp866_8x16);

	SSD1680_Text(&hepd, 88, 88, "Seat", &cp866_8x16);
	char seat_decoded[4] = {0};
	seat_decoded[0] = seat[0];
	seat_decoded[1] = seat[1];
	switch (seat[4])
	{
		case '1':
			seat_decoded[2] = 'A';
			break;
		case '2':
			seat_decoded[2] = 'B';
			break;
		case '3':
			seat_decoded[2] = 'C';
			break;
		case '4':
			seat_decoded[2] = 'D';
			break;
		case '5':
			seat_decoded[2] = 'E';
			break;
		default:
			seat_decoded[2] = 0;
	}
	seat_decoded[3] = '\0';
	if (seat_decoded[0] == '0')  SSD1680_Text(&hepd, 128, 88, seat_decoded + 1, &cp866_8x16);
	else SSD1680_Text(&hepd, 128, 88, seat_decoded, &cp866_8x16);

	SSD1680_Text(&hepd, 88, 104, "Arrive", &cp866_8x14);
	char convert_arr_time[6] = {0};
	convert_arr_time[0] = arr_time[0];
	convert_arr_time[1] = arr_time[1];
	convert_arr_time[2] = ':';
	convert_arr_time[3] = arr_time[2];
	convert_arr_time[4] = arr_time[3];
	convert_arr_time[5] = '\0';
	SSD1680_Text(&hepd, 88, 118, convert_arr_time, &cp866_8x16);
	SSD1680_Text(&hepd, 8, 112, sta_code_decoder(arr_sta), &cp866_8x16);

	static uint8_t my_new_array[DEST_DIM][DEST_DIM];
	unpack_to_buffer(version3, my_new_array);
	SSD1680_SetRegion(&hepd, 0, 0, 145, 145, (uint8_t *)my_new_array, NULL);

	SSD1680_Refresh(&hepd, REFRESH_MODE);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

void debug_disp(void)
{
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Text(&hepd,  0, 280, "Predict:", &cp866_8x16);
	char predict_str[12];
	sprintf(predict_str, "%d", result);
	SSD1680_Text(&hepd,  72, 280, predict_str, &cp866_8x16);
	SSD1680_Refresh(&hepd, REFRESH_MODE);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

void unpack_to_epd_format(const unsigned char *src) {
    // 初始化背景為白色 (電子紙通常 1 是白, 0 是黑，或反之，視硬體定義)
    memset(epd_buffer, 0xFF, sizeof(epd_buffer));

    for (int y = 0; y < DEST_DIM; y++) {
        for (int x = 0; x < DEST_DIM; x++) {
            // 使用「最近鄰插值」找到對應的原始 QR 坐標
            int src_x = x * SRC_DIM / DEST_DIM;
            int src_y = y * SRC_DIM / DEST_DIM;

            // 從原始 116 bytes 中提取位元
            int byte_idx = (src_y * 4) + (src_x / 8);
            int bit_pos  = 7 - (src_x % 8);
            int is_dark  = (src[byte_idx] >> bit_pos) & 1;

            if (is_dark) {
                // 將對應的位元設為 0 (黑色)
                // 這裡假設 SSD1680 的 0 是黑色，1 是白色
                int target_byte_idx = (y * DEST_BYTE_WIDTH) + (x / 8);
                int target_bit_pos  = 7 - (x % 8);
                epd_buffer[target_byte_idx] &= ~(1 << target_bit_pos);
            }
        }
    }
}

